tests/load/artillery-config.yaml
config:
  target: "https://spiritblade.dev"
  tls:
    rejectUnauthorized: false  # Por si el cert tarda en renovarse
  plugins:
    expect: {}
  processor: "./processor.js"

  # Variables compartidas
  variables:
    summoners:
      - { gameName: "Faker", tagLine: "KR1" }
      - { gameName: "Caps", tagLine: "EUW" }
      - { gameName: "Rekkles", tagLine: "EUW" }
      - { gameName: "Uzi", tagLine: "LPL" }

  # ============================================================
  # FASES DEL TEST - diseñadas para disparar HPA y Autoscaler
  #
  # HPA backend: escala a >1 réplica con CPU >70%
  # Cluster Autoscaler: añade nodo cuando pods quedan Pending
  #
  # Con CPU limit=600m por pod y 1 OCPU por nodo (~950m disponible):
  #   - 2 pods  → necesita 2 nodos (ya existen)
  #   - 3 pods  → Autoscaler añade nodo 3
  # ============================================================
  phases:
    - name: "Calentamiento"
      duration: 60
      arrivalRate: 2

    - name: "Carga sostenida (dispara HPA → 2 réplicas)"
      duration: 120
      arrivalRate: 10

    - name: "Pico de estrés (dispara HPA → 3 réplicas + Autoscaler)"
      duration: 180
      arrivalRate: 25
      rampTo: 40

    - name: "Bajada gradual"
      duration: 60
      arrivalRate: 5

# ==============================================================
# ESCENARIOS
# ==============================================================
scenarios:

  # ---- Usuarios anónimos (peso 3) -------------------------
  - name: "Usuario anónimo - búsqueda pública"
    weight: 3
    flow:
      - get:
          url: "/actuator/health"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/summoners/recent"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/v1/summoners/name/Faker"
          capture:
            - json: "$.id"
              as: "summonerId"
      - think: 3
      - get:
          url: "/api/v1/summoners/name/Faker/matches"

  # ---- Registro + login + navegación autenticada (peso 2) --
  - name: "Usuario registrado - dashboard"
    weight: 2
    flow:
      - function: "generateUser"  # genera email/pass únicos en processor.js
      - post:
          url: "/api/v1/auth/register"
          json:
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: [200, 201, 409]  # 409 = ya existe, ignorar
      - post:
          url: "/api/v1/auth/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/v1/dashboard/me/stats"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - get:
          url: "/api/v1/dashboard/me/favorites"
          headers:
            Authorization: "Bearer {{ token }}"

  # ---- Carga pura en BD/Redis - endpoint más pesado (peso 2) -
  - name: "Carga intensiva - summoner + masteries"
    weight: 2
    flow:
      - loop:
          - get:
              url: "/api/v1/summoners/name/{{ $loopElement.gameName }}/matches"
          - think: 1
          count: 3
          over: summoners